app/Http/Controllers/ProductController.php

select * from `products` order by `created_at` desc limit 3
---
    public function index()
    {
        $products_home = Product::latest()->take(3)->get();